import string

line = r"""Сколько помню себя – я никогда не болел. Нет, вру – болел, но как бы это сказать… чихнул пару раз, 
и все – болезнь убиралась от меня, как будто меня напичкали антибиотиками или же сделали кучу уколов. 
аже когда в нашем классе, а потом в университете свирепствовали эпидемии гриппа, я ходил по опустевшим коридорам учебных
 заведений с видом победителя – хрен вам, а не комиссарского тела! И это при том, что спортом я особо-то не занимался, 
 никогда не злоупотреблял физкультурой или какими-нибудь оздоровляющими упражнениями.
Чем горжусь? Тем, что, как сказал знакомый медик, от предков мне достался невероятный иммунитет? Да, горжусь, 
а почему бы нет? Моя прабабушка с маминой стороны, простая деревенская баба, дожила до ста семнадцати лет. 
Кстати – по дошедшим до меня слухам, она была деревенской колдуньей и уходила из жизни очень тяжело.
Как-то бабушка виновато сказала моей матери: «Она так просила взять ее за руку – взяла бы, она бы так не мучилась! 
икак не могла уйти… так и померла в муках, ругала меня все. Она же должна была передать свою силу мне, а не вышло. 
Мне бы тогда пришлось передавать силу Петьке… ну ее, силу эту. Прожили жизнь как люди, и слава богу! Эй ты, шпана, 
ну-ка хватит подслушивать!» Я с позором был изгнан из-за кухонной двери и бит веником.
Я тоже ничем не отличался от всех окружающих – ну кроме, как сказал, отменным здоровьем, которое не могли пошатнуть 
никакие СПИД или проказа. (Тьфу-тьфу! Как говорила бабушка, язык мой – враг мой!) Дожил я до двадцати двух лет спокойно,
 сытно и весело – пока не случились эти события, перевернувшие всю мою жизнь…
Этот день начался как обычно: я пришел в фирму по ремонту сложной бытовой техники – телевизоров, мониторов и всякой 
такой хрени, взгромоздился в свое кресло, предвкушая чашку кофе и общение в скайпе с друзьями, а уже после плотного 
возлияния и общения собираясь наконец проверить этот чертов ящик, занимающий половину моего рабочего места.
В огромном зале было светло и прохладно, гудела аппаратура и пощелкивали выключатели, у входа в зал скапливалась 
небольшая группка знакомых и знакомых знакомых мастеров, ожидающих выхода своего благодетеля к столу охранника – 
нормальная обстановка сервисного центра по ремонту, к которой я привык за полгода, что здесь работаю, и которая вызывала
 только скуку и больше никаких эмоций. Платили здесь неплохо, и после окончания физмата я устроился сюда работать через 
 папиного приятеля, имеющего какое-то отношение к системе этих сервисов.
Так-то работа меня не напрягала, мне с детства нравилось возиться с приборами – дома имелся осциллограф и различные 
причиндалы для ремонта техники, так что тут я был, можно сказать, на своем месте. Амбициозностью я не обладал – хватает 
на жизнь, на одежду, обувь, на пиво и сходить в клуб с девчонкой, и ладно. Ну да, хотелось бы там мотоциклет с визжащим 
глушителем, и чтобы девка прижималась ко мне голыми сиськами, смеясь и размахивая снятой майкой, но я смотрел на жизнь 
реально: на хороший моцик надо много денег, а на плохом только позориться, что касается темы сисег – конечно, вниманием 
не был обижен, но и сексуальным маньяком не числился. В общем, среднестатистический парень, каких миллионы и на которых 
держится весь мир. Так я считал до этого дня…
Закончив свои делишки и искоса поглядывая на приближающегося ко мне начальника группы, я с умным видом снял заднюю 
крышку телевизора и погрузил свои умелые руки внутрь, автоматически, как последний лох, цапанувши обеими руками за 
внутренности аппарата Что происходило в течение последующих десяти минут, я не помню. Мне рассказывали, что я вскрикнул 
 с грохотом свалился на каменный пол, ударившись об него головой с таким стуком, что услышал даже охранник в двадцати 
 метрах от меня.
Подбежавший ко мне начальник группы кинулся слушать сердцебиение – его не было. Минут пять я лежал на полу в окружении 
толпы тупо взирающих на меня соратников, пока их не растолкал с матерными выражениями и пиханием локтями старый мастер, 
хромой, перекошенный на одну сторону Василий Петрович, работавший по вызовам еще в советское время.
Он кинулся ко мне и с силой ударил несколько раз по груди сложенными вместе кулаками, прямо в сердце. Потом на этом 
месте у меня был огромный синячина, и сильно болела грудь – мастер был сухонький и старенький, но ходьба с клюшкой так 
натренировала его руки, что он бы мог гнуть ими подковы… Сердце снова пошло. 
Сколько я был в состоянии клинической смерти? Никто не знает. Одним показалось, что прошло минут десять с того момента, 
как мое сердце остановилось от удара током, другие говорили, что прошла всего минута. Я благодарен судьбе, что рядом 
оказался этот злой, перекошенный жизнью старикашка – старый мастер Петрович, ему я и благодарен за все, что со мной 
случилось дальше. Иначе я бы уже лежал за железной оградкой, под дурацким памятником с еще более дурацкой фоткой, 
которую достали бы из моего университетского альбома.
Пробуждение было странным – я не понимал, где нахожусь. Надо мной, в необъятной вышине, плавали знакомые лица, но я 
никак не мог сосредоточиться и узнать их – вроде лица знакомые, но имена вылетели из головы, и все тут! Потом зрение 
сфокусировалось, и я узнал Петровича, он произнес три слова, два из которых были матерные, присовокупив:
– Чуть парня не загубили, болваны! Вот вам урок на будущее – не хватайтесь ручками поганенькими за что угодно, 
не подумав! – Дальше следовал непереводимый фольклор в мой адрес, безрукого придурка с кривыми руками.
Вот интересно, как могут сосуществовать эти два взаимоисключающих факта – безрукий криворукий придурок? Ведь если у 
меня нет рук, то как они могут быть кривыми? Логичность этой мысли и сам процесс размышления разогнали мой мозг, и я 
все-таки осознал, что со мной что-то не так, и понял, что лежу на полу в окружении толпы любопытных людей, 
воспользовавшихся случаем, чтобы увильнуть от трудовой деятельности.
Тут же в голову ударила боль от столкновения с каменным полом – ощупав затылок, я обнаружил на нем страшнейшую шишку, 
размером с яйцо, не меньше. Голова сразу закружилась, и меня затошнило, что тотчас разогнало любопытствующих подальше 
от меня: смотреть, как помирает знакомый, довольно весело и интересно, а вот получить порцию блевотины на ботинок – 
не так забавно.
Впрочем, содержимое желудка – два яйца всмятку и бутерброд с сыром-маслом – я все-таки в себе удержал, но мне было 
реально хреново.
С помощью начальника группы Андрея я сел в свое кресло, откинулся на спинку и замер, пережидая очередной приступ 
дурноты. В глазах плавали мошки, какие-то веревки, нитки и сетки – такой гадости никогда не видал. Сколько ни моргал – 
нитки-шнурки никуда не девались, насылая на меня тошноту и боль. Закрыл глаза.
– Ну что, Михайлов, может, «скорую» тебе вызвать? А может, без «скорой» обойдемся – поедешь домой, я тебя отвезу! 
Ты сегодня не работник, это точно! – Жизнерадостный голос начальника группы ремонтников Андрея просто сочился 
сочувствием, а в моей больной голове неожиданно вспыхнула картинка: Андрей на пляже, рядом с загорелой телкой и 
бутылкой пива.
Я встряхнул головой – ясно, да, хочет воспользоваться случаем и свалить из офиса, чтобы потом сквозануть на пляж и 
позагорать. Похвальное желание – в такой ясный летний день смотреть на скучные рожи коллег и слушать гул неоновых ламп 
это просто извращение. Почему бы не помочь человеку принять правильное решение? Да пусть едет, пусть окажет помощь 
своему подчиненному.
– Да, Андрей… что-то мне нехорошо… отвези меня домой, на улицу Котовского. Знаешь, где это?
– Знаю, конечно, не вопрос! Не заблюешь мне сиденья? Как чувствуешь себя?
– Нормально… почти. Возьми на всякий случай пакет с собой, вдруг что – я в него поблюю. Поможешь мне дойти? Я что-то 
хреново вижу – в глазах мельтешит все, не пойму ничего. Отлежусь дома, а там видно будет, что делать… Может, в больничку
 схожу.
– Ага. Только это, Петь… в больничке скажи, что дома упал, после работы, ладно? А то нас премии лишат. А мы тебе тут 
больничный нормально закроем, отпуск еще сделаем… Лишнего не говори, ладно? – Простодушно-хитрое лицо тридцатилетнего 
начальника озарилось внутренним светом от осознания своей правильности и ума: вот, мол, какой я – и товарищу помогу, 
и производству не наврежу.
– Ладно, ладно, помогай давай, а то я опять грохнусь, – досадливо сказал я и, пошатываясь, встал с своего рабочего 
места.
Окинул взглядом стол – телефон не оставил, документы на месте – можно и валить отсюда. Отлежусь с недельку, отдохну и 
снова сюда. Тогда я не знал, что на своем законном рабочем месте был в последний раз"""

vowel = 'аеёиоуэыюя'
punctuation = string.punctuation

# убираем знаки пунктуации
for p in punctuation:
    if p in line:
        line = line.replace(p, '')

# Убираем двойные пробелы
line = ' '.join(line.split())

line = line.split(' ')

line.sort(key=len)
line.reverse()

# словарь слов и их гласных
word_dict = {}
for word in line:
    count = 0
    lst_vowel = [letter for letter in word if letter in vowel]
    word_dict[word] = lst_vowel

for item in word_dict.items():
    if (len(set(item[1]))) == 1:
        print(f"Слово: \"{item[0]}\", его длина: {len(item[0])}, кол-во гласных: {len(item[1])}")
        break
